c = [list(map(int, input().split())) for i in range(3)]

# 矛盾していないかどうかを保持する変数
ok = True

# Cの0列目と1列目の差を調べ、全て同じ値でなければ矛盾
if c[0][0] - c[0][1] != c[1][0] - c[1][1] or c[1][0] - c[1][1] != c[2][0] - c[2][1]:
    ok = False

# Cの1列目と2列目の差を調べ、全て同じ値でなければ矛盾
if c[0][1] - c[0][2] != c[1][1] - c[1][2] or c[1][1] - c[1][2] != c[2][1] - c[2][2]:
    ok = False

# Cの0行目と1行目の差を調べ、全て同じ値でなければ矛盾
if c[0][0] - c[1][0] != c[0][1] - c[1][1] or c[0][1] - c[1][1] != c[0][2] - c[1][2]:
    ok = False

# Cの1行目と2行目の差を調べ、全て同じ値でなければ矛盾
if c[1][0] - c[2][0] != c[1][1] - c[2][1] or c[1][1] - c[2][1] != c[1][2] - c[2][2]:
    ok = False

if ok:
    print('Yes')
else:
    print('No')